app/controllers/articles_controller.rb

	def update
		@article = Article.find(params[:id])
		@article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "articles" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "Android-Logo.png"], ["image_file_size", 6255], ["image_updated_at", "2015-12-11 23:00:06.806921"], ["updated_at", "2015-12-11 23:00:06.823603"], ["id", 1]]